app/controllers/api/v1/games_controller.rb

  def create
    @game = Game.new(game_params)
    if @game.save
---
INSERT INTO "games" ("user_id", "wpm", "game_won") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["wpm", 73], ["game_won", "f"]]