app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "colostom"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "colostomy-bag"], ["LIMIT", 1]]
---
  def create
    @user = User.find_or_create_by(username: params[:username])